app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "本"], ["body", "感想"], ["created_at", "2020-02-11 11:13:47.731923"], ["updated_at", "2020-02-11 11:13:47.731923"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = 'Book was successfully created.'
      redirect_to book_path(@book)
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "漫"], ["updated_at", "2020-02-11 14:17:10.631444"], ["id", 4]]
SELECT "books".* FROM "books"
---
  def update
    book = Book.find(params[:id])
    if book.update(book_params)
    flash[:notice] = "Book was successfully updated."
    redirect_to book_path(@book)
    else
    @books = Book.all